package main

import "fmt"

func main() {
	var myArr = [][]int{
		{0, 1, 2, 3},   /* 第一行索引为 0 */
		{4, 5, 6, 7},   /* 第二行索引为 1 */
		{8, 9, 10, 11}, /* 第三行索引为 2 */
	}
	fmt.Println("二维切片值是:", myArr)
	fmt.Printf("二维切片地址: %p\n\n", &myArr)

	for i := 0; i < 3; i++ {
		fmt.Printf("切片第一维 myArr[%d] = %v, 地址 = %p\n", i, myArr[i], &myArr[i])
		for j := 0; j < 4; j++ {
			fmt.Printf("切片第二维 myArr[%d][%d] = %v, 地址 = %p\n", i, j, myArr[i][j], &myArr[i][j])
		}
		fmt.Println()
	}

	//二维切片值是: [[0 1 2 3] [4 5 6 7] [8 9 10 11]]
	//二维切片地址: 0xc000082000
	//
	//切片第一维 myArr[0] = [0 1 2 3], 地址 = 0xc000084000
	//切片第二维 myArr[0][0] = 0, 地址 = 0xc000086000
	//切片第二维 myArr[0][1] = 1, 地址 = 0xc000086008
	//切片第二维 myArr[0][2] = 2, 地址 = 0xc000086010
	//切片第二维 myArr[0][3] = 3, 地址 = 0xc000086018
	//
	//切片第一维 myArr[1] = [4 5 6 7], 地址 = 0xc000084018
	//切片第二维 myArr[1][0] = 4, 地址 = 0xc000086020
	//切片第二维 myArr[1][1] = 5, 地址 = 0xc000086028
	//切片第二维 myArr[1][2] = 6, 地址 = 0xc000086030
	//切片第二维 myArr[1][3] = 7, 地址 = 0xc000086038
	//
	//切片第一维 myArr[2] = [8 9 10 11], 地址 = 0xc000084030
	//切片第二维 myArr[2][0] = 8, 地址 = 0xc000086040
	//切片第二维 myArr[2][1] = 9, 地址 = 0xc000086048
	//切片第二维 myArr[2][2] = 10, 地址 = 0xc000086050
	//切片第二维 myArr[2][3] = 11, 地址 = 0xc000086058
}
