package main

import (
	"fmt"
	"time"
)

func main() {
	for i := 1; i <= 5; i++ {
		go func() {
			for j := 1; j <= 5; j++ {
				fmt.Printf("协程%d:%d\n", i, j)
			}
		}()
	}

	time.Sleep(time.Second)
	fmt.Println("main func")
}

//说明
//1: 协程是由主协程开辟[line 9, 10]
//2: 协程开辟后其本身需要初始化 [line 11, 12, 13]

//当i=5后会最后执行一次++运算，此时等于6
//协程6:1
//协程6:2
//协程6:3
//协程6:4
//协程6:5
//协程6:1
//协程6:1
//协程6:2
//协程6:3
//协程6:4
//协程6:5
//协程6:1
//协程6:2
//协程6:3
//协程6:4
//协程6:5
//协程6:2
//协程6:1
//协程6:2
//协程6:3
//协程6:4
//协程6:5
//协程6:3
//协程6:4
//协程6:5
//main func